КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_ПроизвольныеДанные/КонтурЛогистика_ПроизвольныеДанные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_ПроизвольныеДанные</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Реквизит1</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ГорючеСмазочныеМатериалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <comment>Из какого объекта произошла конвертация</comment>
    <type>
      <types>DefinedType.КонтурЛогистика_ДокументыУчетнойСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаКонвертацииРС</name>
    <comment>Какая НКРС использовалась при синх. в 1С</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_НастройкиКонвертацииРегистровСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>СинхронизацияССервисом</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыСинхронизации</types>
    </type>
  </attributes>
  <attributes>
    <name>СинхронизацияСОбъектом1С</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыСинхронизации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОрганизацияДиадок</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Разрез1</name>
    <comment>Состав типо должен соответствовать Спр.НКРС.ОтборРазрез1</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Разрез2</name>
    <comment>Состав типо должен соответствовать Спр.НКРС.ОтборРазрез2</comment>
    <type>
      <types>EnumRef.КонтурЛогистика_ТипыПоказанийТоплива</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Разрез3</name>
    <comment>Состав типо должен соответствовать Спр.НКРС.ОтборРазрез3</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_СтатусыСинхронизации/КонтурЛогистика_СтатусыСинхронизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_СтатусыСинхронизации</name>
  <enumValues>
    <name>НеНачата</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>Пропустить</name>
  </enumValues>
  <enumValues>
    <name>УспешноЗавершена</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_ПроизвольныеДанные/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ОтборСтатус", ОтборСтатус);
	
	ТипДанныхЗадан = Параметры.Свойство("ТипДанных", ТипДанных);
	
	Если ТипДанныхЗадан И ЗначениеЗаполнено(ТипДанных) Тогда
		НастроитьФормуПоТипуДанных(ТипДанных);
	Иначе
		Элементы.ТипДанных.Видимость = Истина;
	КонецЕсли;
	
	Если Параметры.Свойство("ДокументОснование") Тогда
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список, "ДокументОснование", Параметры.ДокументОснование, ВидСравненияКомпоновкиДанных.Равно,, Истина);
	КонецЕсли;
	
	Если ОтборСтатус = "" Тогда
		ОтборСтатус = "Все";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьОтборы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборСтатусПриИзменении(Элемент)
	
	ОбновитьОтборы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФормуЗаписиПроизвольныхДанных(ТекущиеДанные, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Истина;
	ОткрытьФормуЗаписиПроизвольныхДанных(ТекущиеДанные, СтандартнаяОбработка);
	
	Если Не СтандартнаяОбработка Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПропуститьВыделенные(Команда)
	
	ПропуститьВыделенныеСервер();
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура СинхронизироватьЗаписьС1С(Команда)
	
	ОбработатьСтрокуПроизвольныхДанныхРС();
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьФормуПоТипуДанных(ТипДанных)
	
	Набор = "АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ";
	ТипДанныхЧитаемый = ТипДанных;
	
	Для Счет = 1 По СтрДлина(Набор) Цикл
		
		ТекущийСимвол = Сред(Набор, Счет, 1);
		ТипДанныхЧитаемый = СтрЗаменить(ТипДанныхЧитаемый, ТекущийСимвол, " " + НРег(ТекущийСимвол));
		
	КонецЦикла;
	
	Заголовок = "Произвольные данные:" + ТипДанныхЧитаемый;
	
	Элементы.ТипДанных.Видимость = Ложь;
	
	КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, "ТипДанных", ТипДанных, ВидСравненияКомпоновкиДанных.Равно,, Истина);
	
	ПредставленияПолей = РегистрыСведений.КонтурЛогистика_ПроизвольныеДанные.ПараметрыПолейПоТипуДанных(ТипДанных);
	
	Для Каждого ТекущаяСтрока Из ПредставленияПолей Цикл
		
		НайденныйЭлемент = Элементы.Найти(ТекущаяСтрока.Ключ);
		Если НайденныйЭлемент = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НайденныйЭлемент.Заголовок = ТекущаяСтрока.Значение.Заголовок;
		
	КонецЦикла;
	
	Если ТипДанных = РегистрыСведений.КонтурЛогистика_ПроизвольныеДанные.ТипыДанных().ПодпискиИОплата Тогда
		НастроитьФормуДляПодписокИОплаты();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуДляПодписокИОплаты()
	
	Элементы.ОтборСтатус.Видимость = Ложь;
	Элементы.ГруппаСинхронизация.Видимость = Ложь;
	Элементы.ФормаПропуститьВыделенные.Видимость = Ложь;
	Элементы.ФормаСинхронизироватьЗаписьС1С.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтборы()
	
	ИспользованиеОтбораСтатус = Истина;
	ОтборСтатусЗначение = Неопределено;
	
	Если ОтборСтатус = "Все" Тогда
		ИспользованиеОтбораСтатус = Ложь;
	ИначеЕсли ОтборСтатус = "НеНачата" Тогда
		ОтборСтатусЗначение = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыСинхронизации.НеНачата");
	ИначеЕсли ОтборСтатус = "Ошибка" Тогда
		ОтборСтатусЗначение = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыСинхронизации.Ошибка");
	ИначеЕсли ОтборСтатус = "Пропустить" Тогда
		ОтборСтатусЗначение = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыСинхронизации.Пропустить");
	ИначеЕсли ОтборСтатус = "УспешноЗавершена" Тогда
		ОтборСтатусЗначение = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыСинхронизации.УспешноЗавершена");
	КонецЕсли;
	
	ГруппаИлиСтатусов = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
		Список.Отбор, "Статусы", ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
	КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ГруппаИлиСтатусов, "СинхронизацияССервисом", ОтборСтатусЗначение, ВидСравненияКомпоновкиДанных.Равно,, ИспользованиеОтбораСтатус);
	КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ГруппаИлиСтатусов, "СинхронизацияСОбъектом1С", ОтборСтатусЗначение, ВидСравненияКомпоновкиДанных.Равно,, ИспользованиеОтбораСтатус);
	
КонецПроцедуры

&НаСервере
Процедура ПропуститьВыделенныеСервер()
	
	СтатусПропущен = Перечисления.КонтурЛогистика_СтатусыСинхронизации.Пропустить;
	ТекстСообщения = "Пропущен пользователем """ + Строка(ПараметрыСеанса.ТекущийПользователь) + """ в " + Строка(ТекущаяДатаСеанса());
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	Для Каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
		РегистрыСведений.КонтурЛогистика_ПроизвольныеДанные.ОбновитьСтатусыСинхронизации(
			ВыделеннаяСтрока, СтатусПропущен, СтатусПропущен, ТекстСообщения);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьСтрокуПроизвольныхДанныхРС()
	
	ТекущиеДанные = Элементы.Список.ВыделенныеСтроки[0];
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОрганизацияДиадок", ТекущиеДанные.ОрганизацияДиадок);
	Запрос.УстановитьПараметр("ТипДанных", ТекущиеДанные.ТипДанных);
	Запрос.УстановитьПараметр("Разрез1", ТекущиеДанные.Разрез1);
	Запрос.УстановитьПараметр("Разрез2", ТекущиеДанные.Разрез2);
	Запрос.УстановитьПараметр("Разрез3", ТекущиеДанные.Разрез3);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_ПроизвольныеДанные.ОрганизацияДиадок КАК ОрганизацияДиадок,
	|	КонтурЛогистика_ПроизвольныеДанные.ТипДанных КАК ТипДанных,
	|	КонтурЛогистика_ПроизвольныеДанные.Разрез1 КАК Разрез1,
	|	КонтурЛогистика_ПроизвольныеДанные.Разрез2 КАК Разрез2,
	|	КонтурЛогистика_ПроизвольныеДанные.Разрез3 КАК Разрез3,
	|	КонтурЛогистика_ПроизвольныеДанные.Количество КАК Количество,
	|	КонтурЛогистика_ПроизвольныеДанные.Дата КАК Дата,
	|	КонтурЛогистика_ПроизвольныеДанные.Ответственный КАК Ответственный,
	|	КонтурЛогистика_ПроизвольныеДанные.Реквизит1 КАК Реквизит1
	|ИЗ
	|	РегистрСведений.КонтурЛогистика_ПроизвольныеДанные КАК КонтурЛогистика_ПроизвольныеДанные
	|ГДЕ
	|	КонтурЛогистика_ПроизвольныеДанные.ОрганизацияДиадок = &ОрганизацияДиадок
	|	И КонтурЛогистика_ПроизвольныеДанные.ТипДанных = &ТипДанных
	|	И КонтурЛогистика_ПроизвольныеДанные.Разрез1 = &Разрез1
	|	И КонтурЛогистика_ПроизвольныеДанные.Разрез2 = &Разрез2
	|	И КонтурЛогистика_ПроизвольныеДанные.Разрез3 = &Разрез3";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		КонтурЛогистика_КонвертацияСервер.ОбработатьСтрокуПроизвольныхДанныхРС(Выборка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуЗаписиПроизвольныхДанных(ДанныеСтроки, СтандартнаяОбработка)
	
	ПараметрыОткрытия = ПараметрыОткрытияФормыЗаписиНаСервере(ДанныеСтроки.ТипДанных,
		ДанныеСтроки.ОрганизацияДиадок, ДанныеСтроки.Разрез1, ДанныеСтроки.Разрез2, ДанныеСтроки.Разрез3);
	
	Если Не ЗначениеЗаполнено(ПараметрыОткрытия.ПолноеИмяФормы) Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		ПараметрыОткрытия.ПолноеИмяФормы,
		ПараметрыОткрытия.ПараметрыФормы,
		,
		ЭтаФорма);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПараметрыОткрытияФормыЗаписиНаСервере(ТипДанных, ОрганизацияДиадок, Разрез1, Разрез2, Разрез3)
	
	Результат = Новый Структура("ПолноеИмяФормы, ПараметрыФормы", "", Неопределено);
	
	ПолноеИмяФормы = РегистрыСведений.КонтурЛогистика_ПроизвольныеДанные.ПолноеИмяФормыЗаписиПоТипуДанных(ТипДанных);
	
	Если Не ЗначениеЗаполнено(ПолноеИмяФормы) Тогда
		Возврат Результат;
	КонецЕсли;
	
	КлючЗаписи = РегистрыСведений.КонтурЛогистика_ПроизвольныеДанные.КлючЗаписи(
		ОрганизацияДиадок, ТипДанных, Разрез1, Разрез2, Разрез3);
	
	Результат.ПолноеИмяФормы = ПолноеИмяФормы;
	Результат.ПараметрыФормы = Новый Структура("Ключ", КлючЗаписи);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
